<template>
    <div class="container">
        <h5 class="mt-3">Основные правила сайта</h5>
        <div class="col-12 content cards mb-3 p-3">
            <div>• Сайт предназначен для лиц старше 18 лет, если вам менее 18, немедленно покиньте его.</div>
            <div>• Запрещено передавать доступ от своего аккаунта третьим лицам.</div>
            <div>• Сайт не является азартной игрой!</div>
            <div>• Администрация сайта в праве заблокировать учетную запись без объяснения причин блокировки.</div>
            <div>• Сайт не несет ответственность за проигранный баланс.</div>
            <div>• Запрещено использовать баги или уязвимости сайта, все попытки использование их ведут за собой блокировку аккаунта.</div>
            <div>• Запрещено пользоваться любым софтом, по типу кликеров и командами в консоли.</div>
            <div>• Запрещено использовать трансфер средств с одной платежной системы на другую.</div>
        </div>
        <b>Не нашли ответ на свой вопрос?</b>
        <br>
        <a target="_blank" href="https://vk.com/im?sel=-222960403"><button class="blue mr-2">Обратиться в поддержку</button></a>
        <h5 class="mt-3">Полезно знать</h5>
        <div class="col-12 content cards mb-3 p-3">
            <div>• Запрещено использовать один кошелек для вывода на нескольких аккаунтах, а также чужие реквизиты для вывода средств.</div>
            <div>&nbsp;&nbsp;&nbsp;<b data-v-194326c0="">Чужие реквизиты</b> - несовпадение инициалов кошелька с данными вашего аккаунта.</div>
            <div>• Запрещено использовать несколько аккаунтов для игры на сайте.</div>
            <div>&nbsp;&nbsp;&nbsp;<b data-v-194326c0="">Мультиаккаунт</b> - наличие более одного аккаунта, при факте нарушения данного правила, ваш аккаунт будет заблокирован.</div>
            <div>• Запрещено использовать аккаунты не со своими данными (имя и фамилия).</div>
            <div>&nbsp;&nbsp;&nbsp;<b data-v-194326c0="">Фейк</b> - аккаунт без личных фото, друзей и прочее.</div>
            <div>• Запрещено использовать бонусную систему сайта для корыстных умыслов, с целью получения прибыли.</div>
            <div>&nbsp;&nbsp;&nbsp;<b data-v-194326c0="">Bonus Hunting</b> - сумма полученных бонусов превышает сумму пополнения за последнее время.</div>
        </div>
        <h5 class="mb-3 mt-3">Ответы на часто задаваемые вопросы</h5>
        <div 
            class="col-12 content cards mb-3 p-3" 
            v-for="item in items" 
            :key="item"
        >
            <h6>{{ item.title }}</h6>
            <div>{{ item.quest }}</div>
        </div>
    </div>
</template>

<script>
export default {
    data() {
        return {
            items: []
        }
    },
    methods: {
        init() {
            this.$root.axios.post('/faqs/get')
            .then(response => {
                const {data} = response

                this.items = data.filter(item => item.quest) 
            })
        },
    },
    mounted() {
        this.init()
    }  
}
</script>